#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Wed Jan 10 14:49:07 2024

add_design "D:/admin/desktop/voice_loop_2l50/source/ES7243E_reg_config.v"
add_design "D:/admin/desktop/voice_loop_2l50/source/ES8156_reg_config.v"
add_design "D:/admin/desktop/voice_loop_2l50/source/i2c_com.v"
add_design "D:/admin/desktop/voice_loop_2l50/source/i2s_loop.v"
add_design "D:/admin/desktop/voice_loop_2l50/source/pgr_i2s_rx.v"
add_design "D:/admin/desktop/voice_loop_2l50/source/pgr_i2s_tx.v"
add_design "D:/admin/desktop/voice_loop_2l50/source/voice_loop.v"
add_design D:/admin/desktop/voice_loop_2l50/ipcore/PLL/PLL.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module voice_loop_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module voice_loop_test
add_constraint "D:/admin/desktop/voice_loop_2l50/voice.fdc"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module voice_loop_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/admin/desktop/voice_loop_50/synthesize/voice_loop_test_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module voice_loop_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module voice_loop_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module voice_loop_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module voice_loop_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module voice_loop_test
synthesize -ads -selected_syn_tool_opt 2 
